package homework.lesson5


class Service(private val rate: Int, private val listBuildings: List<Buildings>) {
    /*Метод, который преобразует поля нашего класса в описание на английском,
    а цену преобразует в валюту (курс, можно создать константой) и возвращает
     новую коллекцию отсортированную по возрастанию цены.*/
    fun doDescriptionConvertSort() {

    }
    /*Метод, группирующий элементы списка по типу кузова или по какому-либо заранее выбранному полю*/
    fun groupingByType() {}

    /*Метод, возвращающий количество элементов из списка соответствующих переданному условию,
    после чего преобразовать список названий и взять первые 3 элемента*/
    fun returnFirstThree() {}


}